{"pageProps":{"frontmatter":{"title":"Organisations for Rural Clinicians"},"slug":"rural-organisations","content":"We are developing our Rural Champion's and Rural Buddy systems. In the meantime here are some rural specific organisations and journals.\r\n\r\nWhats a **Rural champion**? These are rural veterans willing to share their knowledge of DoH systems and how to use the systems as well as giving advice about \"what to do\" in clinical situations.\r\n\r\nThe **Rural Buddies** is an email or WhatsApp Group of RuDASA members in your District.\r\n\r\nFor support on specific conditions go to the Clinical Resources to find associations and organisations working in that clinical field.\r\n\r\n## Centres for Rural Health\r\n\r\n### Ukwanda Centre for Rural Health\r\nThe [Ukwanda Centre for Rural Health](https://blogs.sun.ac.za/ukwanda/) vision is to train health care professionals with applicable knowledge and hands on experience of the health issues facing rural and underserved communities. Ukwanda’s mission is to focus on making a difference to rural health care through empowering students, health workers and communities for wellness.\r\n\r\n### Wits Centre for Rural Health\r\nThe [Wits Centre for Rural Health (CRH)](https://www.wits.ac.za/health/research-entities/centre-for-rural-health/about-us/about-us/) is an academic centre with a particular focus on 4 key areas of rural health advocacy, teaching, research and policy through support and sustainability. Together with partnerships and communities, the CRH aims to foster high quality rural health care through:Service Training Advocacy Research, and Sustainable growth.\r\n\r\nThe Centre is committed to improving the health care offered to impoverished people living in rural and underserved areas. Including research and programmes in Health Systems Strengthening, Human Resources for Health and Health and Social Justice.\r\n\r\n## Search for Rural Journal Articles\r\n### The Rural Health Research Gateway\r\nThe [Rural Health Research Gateway](https://www.ruralhealthresearch.org/publications) provide easy and timely access to research and findings of the FORHP-funded Rural Health Research Centers, 1997-present. Their goal is to help move new research findings of the Rural Health Research Centers to various end users as quickly and efficiently as possible. The site can be used to find:\r\n\r\n* Completed rural health research [products and journal articles](https://www.ruralhealthresearch.org/publications)\r\n* Information about the r[esearch centers](https://www.ruralhealthresearch.org/centers)\r\n* Information about [individual researchers](https://www.ruralhealthresearch.org/researchers)\r\n* Current research center [projects](https://www.ruralhealthresearch.org/projects)\r\n\r\n### Rural and Remote Health\r\n[Rural and Remote Health (RRH)](https://www.rrh.org.au/) is an open-access international academic journal serving rural and remote communities and publishing articles by rural health practitioners, educators, researchers and policy makers. The African section is committed to innovative approaches to enhance information sharing amongst the health care community in rural Africa.\r\n\r\n\r\n## International Contacts & Journals\r\n### WONCA\r\nThe [WONCA Working Party on Rural Practice (RuralWONCA)](https://www.globalfamilydoctor.com/) is an active network of rural family doctors and rural academics from each of the world's regions: Europe, Asia, Africa, North America, South America, Australasia/Pacific. Members of the working party are expected to be engaged and active in the organisation and are selected after presenting to the Working Party Council, usually or before one of our [WONCA World Rural Health conferences](https://www.globalfamilydoctor.com/Conferences/WONCAWorldRuralHealthConference2022.aspx). Their vision is health for all rural people around the world. They also have a [rural resource repository](https://ruralwonca.org/).\r\n\r\n### Rural Seeds\r\n[Rural Seeds](https://www.ruralseeds.net/) is a network made up of students and young doctors with the aim of being a worldwide network of training awareness and guidance for rural practice, using the guidance and knowledge available on RuralWONCA and its members.\r\n\r\n### National Rural Health Alliance\r\nThe [National Rural Health Alliance](https://www.ruralhealth.org.au/about) is the peak national body working to improve the health of Australians living in rural and remote areas. The NRHA is comprised of twenty-four Member Bodies, each of which is a national organisation in its own right. The twenty-four represent both the consumers of health services and the health professionals providing service to non-metropolitan areas.\r\n\r\n### National Rural Health Association\r\nThe [National Rural Health Association](https://www.ruralhealth.us/about-nrha) is a member-driven national organization whose mission is to improve the health of rural Americans and populations through appropriate and equitable health care services as well as to assist its members in providing leadership on rural issues through advocacy, communications, education, and research.\r\n\r\n<!--\r\n    This is a comment and is not displayed on the website. Do not alter this text between arrows (->).\r\n    To change the content in this file, simply retype/ copy+paste any text above, as you would in a normal text file/ word document.\r\n\r\n    Do not change the \"title:\" title, or the ---. Only change the text inside '' for that section.\r\n\r\n    The hashtag ( # ) symbols followed by a space and then text show a heading. The more #s you have, the smaller/\"less important\" the heading. You can add up to 6 # but we suggest max 4 #. make sure each heading is on a separate line.\r\n\r\n    The text surrounded by double stars ( ** ) with no spaces shows bold text.\r\n\r\n    The single star ( * ) followed by a space and then text shows an item in a bulleted list. Make sure each item is on a separate line. \r\n    \r\n    Links are created by putting the text you want to show in square brackets ( [] ) followed by the link in round brackets ( () ). For example, [RuReSA](https://ruresa.org.za/) will show as RuReSA and link to the RuReSA website.\r\n\r\n    Please refer to the \"HOW TO USE\" or \"HOW TO USE SHORT\" files for more information.\r\n -->"},"__N_SSG":true}